CSI API ETABS v1
cStory.GetHeight Method
 Retrieves the height of a defined story
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetHeight(
	string Name,
	ref double Height
)
Function GetHeight (
	Name As String,
	ByRef Height As Double
) As Integer
Dim instance As cStory
Dim Name As String
Dim Height As Double
Dim returnValue As Integer
returnValue = instance.GetHeight(Name,
	Height)
int GetHeight(
	String^ Name,
	double% Height
)
abstract GetHeight :
        Name : string *
        Height : float byref -> int
Parameters
Name
Type: System.String
 The name of a defined story
Height
Type: System.Double
 The height of the story
Return Value
Type: Int32
 Returns zero if the value is successfully retrieved, otherwise returns nonzero.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Height As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'get story height
       ret = SapModel.Story.GetHeight("Story2", Height)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cStory Interface
ETABSv1 Namespace